{
    "intents": [
      {
        "tag": "recommend",
        "patterns": ["Recommend me a computer"],
        "responses": [
          "Please type your specification in following format:<br>RAM:<br>Storage:<br>Max Price:<br>"
        ],
        "context_set": ["recommend","end"]
      },
      {
        "tag": "operating_system_available",
        "patterns": ["What operating systems are available for your computers?"],
        "responses": [
          "We offer computers with various operating systems, including Windows, macOS, and Linux. If you have a specific preference, please let us know!",
          "Our computers come with a choice of operating systems such as Windows, macOS, and Linux. You can select the one that best fits your needs during the purchasing process."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "customize_spec",
        "patterns": [
          "Can I customize the specifications of the computers you offer?"
        ],
        "responses": [
          "Yes, you can customize the specifications of our computers to match your needs. Choose from different options for processors, memory, storage, and more.",
          "Absolutely! We offer a range of customization options for our computers, allowing you to select the specifications that best suit your requirements."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "computer_shop_open",
        "patterns": ["When does the computer shop open?"],
        "responses": [
          "Our store is open Monday through Friday, from 9 AM to 6 PM. On Saturdays, we open from 10 AM to 4 PM.",
          "We’re open Monday to Friday, from 9 AM to 6 PM, and on Saturdays from 10 AM to 4 PM. Feel free to visit us during these hours!"
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "compatible_peripherals",
        "patterns": [
          "How do I know if a computer is compatible with my existing peripherals?"
        ],
        "responses": [
          "You can check compatibility by reviewing the computer's specifications and ensuring it has the necessary ports and connections for your peripherals. If you’re unsure, our support team can help!",
          "To ensure compatibility, compare your peripheral requirements with the computer’s available ports and specifications. If you need assistance, just let us know!"
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "data_transfer",
        "patterns": [
          "Do you offer any services for data transfer from an old computer?"
        ],
        "responses": [
          "Yes, we offer data transfer services to help you move files from your old computer to your new one. Contact us for more details and to schedule an appointment.",
          "We provide data transfer services to assist with migrating your files from an old computer. Get in touch with us for more information and to arrange a transfer."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "pre_installed_software",
        "patterns": [
          "Are your computers pre-installed with software or do I need to buy it separately?"
        ],
        "responses": [
          "Our computers come with essential software pre-installed, such as operating systems and basic utilities. Additional software can be purchased separately if needed.",
          "Basic software is pre-installed on our computers, including the operating system. For additional software or applications, you may need to buy them separately."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "energy_efficiency",
        "patterns": ["What are the energy efficiency ratings of your computers?"],
        "responses": [
          "Our computers have energy efficiency ratings that comply with industry standards. You can find specific ratings and details on the product pages or by contacting our support team.",
          "We ensure our computers meet high energy efficiency standards. Check the product specifications for detailed ratings or reach out to us for more information."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "order_processing_shipping",
        "patterns": [
          "How long does it typically take to process and ship an order?"
        ],
        "responses": [
          "Orders are typically processed and shipped within 2-3 business days. You’ll receive a tracking number once your order is on its way.",
          "Processing and shipping usually take 2-3 business days. After your order is shipped, you’ll get a tracking number to monitor its progress."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "on_site_installation",
        "patterns": ["Do you offer on-site installation or setup services?"],
        "responses": [
          "Yes, we offer on-site installation and setup services for your convenience. Please contact us to arrange a service appointment.",
          "We provide on-site installation and setup services. Contact our team to schedule a visit and ensure your new computer is up and running smoothly."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "track_order_status",
        "patterns": ["Can I track the status of my order after purchase?"],
        "responses": [
          "Yes, you can track your order status online using the tracking number provided once your order is shipped. Check our website for real-time updates.",
          "Absolutely! After your purchase, you’ll receive a tracking number that allows you to monitor the status of your order through our website."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "best_computers_for_gaming",
        "patterns": ["What are the best computers for gaming?"],
        "responses": [
          "To recommend the best gaming computers, could you specify your preferences for RAM, storage, and any particular games or performance levels you are aiming for?",
          "For gaming, we need to know your desired specifications like RAM size, storage capacity, and whether you have any specific games or features in mind. This will help us suggest the best options for you."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "laptops_vs_desktops",
        "patterns": ["What are the differences between laptops and desktops?"],
        "responses": [
          "Are you looking for differences in terms of performance, storage, or portability? Let me know what factors are most important to you, like RAM or storage capacity.",
          "To provide a clear comparison, could you specify what aspects are most important to you, such as RAM, storage, or overall performance? This will help tailor the differences to your needs."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "specifications_for_video_editing",
        "patterns": [
          "What specifications should I look for in a computer for video editing?"
        ],
        "responses": [
          "For video editing, could you specify your needs in terms of RAM, storage space, and any particular software you plan to use? This will help us recommend the most suitable specs.",
          "Can you provide details on the amount of RAM and storage you’re looking for, as well as the types of video projects you work on? This will assist in finding the best computer for your editing needs."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "financing_payment_plans",
        "patterns": ["Do you offer financing or payment plans?"],
        "responses": [
          "We do offer financing options. Could you let us know the amount you're looking to finance and the type of computer you’re interested in? This will help us provide more specific details.",
          "Yes, we offer payment plans. To assist you better, could you specify the total amount you're considering and the type of computer you’re interested in? This will help us find the best financing option for you."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "choosing_computer_for_general_use",
        "patterns": [
          "Can you help me choose a computer for general use or home office work?"
        ],
        "responses": [
          "To help you choose the right computer, could you tell us your preferred RAM and storage options, as well as any specific tasks you plan to use it for?",
          "For general use or home office work, it would be helpful to know your requirements for RAM, storage, and any specific applications you need to run. This will guide us in recommending the best options."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "warranty_coverage",
        "patterns": ["What is the warranty coverage for your computers?"],
        "responses": [
          "Our warranty coverage varies by product. Could you let us know the specific computer model or type you're interested in? This will help provide accurate warranty details.",
          "Warranty coverage can differ based on the computer model. Please specify the type of computer you’re considering so we can provide detailed warranty information."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "promotions_discounts",
        "patterns": ["Are there any ongoing promotions or discounts?"],
        "responses": [
          "We may have promotions or discounts available. Could you specify the type of computer you’re interested in or the range you’re looking at? This will help us check current offers.",
          "To provide information on ongoing promotions, please let us know the type of computer or the price range you’re considering. We can then check for any applicable discounts."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "upgrade_components",
        "patterns": ["Can I upgrade the components of the computer later?"],
        "responses": [
          "Yes, many of our computers allow for component upgrades. Could you specify which components you're considering upgrading, such as RAM or storage, so we can provide detailed information?",
          "Component upgrades are often possible. To give you the best advice, please let us know which parts you’re thinking about upgrading, like RAM or storage."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "return_policy",
        "patterns": [
          "What is the return policy if I’m not satisfied with my purchase?"
        ],
        "responses": [
          "Our return policy varies by product. Could you specify the type of computer or the purchase details so we can provide accurate information on the return process?",
          "Return policies can differ based on the product. Please provide details about the computer you purchased or are considering purchasing, so we can explain the return policy in detail."
        ],
        "context_set": ["end","end"]
      },
      {
        "tag": "technical_support_after_purchase",
        "patterns": ["Do you provide technical support after purchase?"],
        "responses": [
          "Yes, we offer technical support after purchase. Could you let us know the type of computer you bought or are interested in so we can provide specific support details?",
          "We do provide post-purchase technical support. Please specify the computer model or type you have or are considering, and we’ll give you the relevant support information."
        ],
        "context_set": ["end","end"]
      }
    ]
  }
  